---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.DuctSettings.OvalDuctSizeSeparator
source: html/fcde64b8-e345-25cd-29ad-0164438b16ef.htm
---
# Autodesk.Revit.DB.Mechanical.DuctSettings.OvalDuctSizeSeparator Property

The oval duct size separator string.

## Syntax (C#)
```csharp
public string OvalDuctSizeSeparator { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null